#include "NTU.h"
#include "./adc/bsp_adc.h"



/********************************************************************************************************
函数调用：	NTU_Init();//初始化函数
					float Get_NTU_value()//获取浊度百分比
					
主要变量：无

注意事项：在使用本函数库之前请添加前置函数库“./adc/bsp_adc.h”
*********************************************************************************************************/
///////////////////////////////////////////////////////////////////////////////////////////////////
//传感器AD通道
#define	NTU_CH	12				//光敏电阻AD通道数

//硬件电路参数
#define Vref 3.3     //参考电压，单位：V
/////////////////////////////////////////////////////////////////////////////////////////////////////

void NTU_Init()
{
		Rheostat_Init(NTU_CH);
}


//空气中ad值最大为3510左右，不透光环境下ad值最小为10;
double Get_NTU_value()
{
	u16 adcx;
	double temp;
	
		adcx=Get_ADC_Value(NTU_CH);
		printf("adc4 val: %d\r\t",adcx);
	  if(adcx>=2000)
		{
		  adcx=2000;
		}
	temp = (1.0-(adcx/2000.0))*100.0;
	return (double)temp;
}
